site/_plots/blog/ycsb/100/RAMCloud.workloadb.dat
[OVERALL], RunTime(ms), 2058
[OVERALL], Throughput(ops/sec), 48590.86491739553
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1457725947521866
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 3
[TOTAL_GC_TIME_%], Time(%), 0.1457725947521866
[READ], Operations, 95014
[READ], AverageLatency(us), 16.797703496326857
[READ], MinLatency(us), 9
[READ], MaxLatency(us), 346879
[READ], 95thPercentileLatency(us), 17
[READ], 99thPercentileLatency(us), 24
[READ], Return=OK, 95014
[READ], 9, 87.0
[READ], 10, 1093.0
[READ], 11, 24443.0
[READ], 12, 27534.0
[READ], 13, 22607.0
[READ], 14, 9419.0
[READ], 15, 2637.0
[READ], 16, 1928.0
[READ], 17, 1196.0
[READ], 18, 609.0
[READ], 19, 336.0
[READ], 20, 328.0
[READ], 21, 609.0
[READ], 22, 446.0
[READ], 23, 564.0
[READ], 24, 248.0
[READ], 25, 138.0
[READ], 26, 76.0
[READ], 27, 58.0
[READ], 28, 59.0
[READ], 29, 47.0
[READ], 30, 50.0
[READ], 31, 45.0
[READ], 32, 43.0
[READ], 33, 33.0
[READ], 34, 21.0
[READ], 35, 13.0
[READ], 36, 10.0
[READ], 37, 13.0
[READ], 38, 6.0
[READ], 39, 4.0
[READ], 40, 6.0
[READ], 41, 3.0
[READ], 42, 5.0
[READ], 43, 12.0
[READ], 44, 18.0
[READ], 45, 14.0
[READ], 46, 15.0
[READ], 47, 20.0
[READ], 48, 15.0
[READ], 49, 7.0
[READ], 50, 18.0
[READ], 51, 9.0
[READ], 52, 10.0
[READ], 53, 13.0
[READ], 54, 9.0
[READ], 55, 6.0
[READ], 56, 5.0
[READ], 57, 4.0
[READ], 58, 4.0
[READ], 59, 4.0
[READ], 60, 3.0
[READ], 61, 3.0
[READ], 62, 3.0
[READ], 63, 3.0
[READ], 64, 2.0
[READ], 65, 1.0
[READ], 66, 3.0
[READ], 67, 1.0
[READ], 69, 1.0
[READ], 71, 1.0
[READ], 73, 1.0
[READ], 74, 3.0
[READ], 75, 4.0
[READ], 76, 2.0
[READ], 77, 6.0
[READ], 78, 2.0
[READ], 79, 6.0
[READ], 80, 3.0
[READ], 81, 2.0
[READ], 82, 1.0
[READ], 83, 2.0
[READ], 84, 2.0
[READ], 86, 4.0
[READ], 87, 1.0
[READ], 88, 2.0
[READ], 89, 2.0
[READ], 90, 4.0
[READ], 91, 3.0
[READ], 93, 2.0
[READ], 95, 2.0
[READ], 96, 1.0
[READ], 103, 2.0
[READ], 105, 1.0
[READ], 117, 1.0
[READ], 127, 1.0
[READ], 128, 3.0
[READ], 130, 1.0
[READ], 138, 2.0
[READ], 140, 1.0
[READ], 144, 1.0
[READ], 146, 1.0
[READ], 149, 2.0
[READ], 150, 1.0
[READ], 152, 2.0
[READ], 158, 1.0
[READ], 159, 1.0
[READ], 164, 1.0
[READ], 177, 1.0
[READ], 183, 1.0
[READ], 196, 1.0
[READ], 198, 1.0
[READ], 209, 1.0
[READ], 217, 1.0
[READ], 246, 1.0
[READ], 302, 1.0
[READ], 335, 1.0
[READ], 552, 1.0
[READ], 574, 1.0
[READ], 655, 1.0
[READ], 1425, 1.0
[READ], 1670, 1.0
[READ], 2461, 1.0
[READ], 2471, 1.0
[READ], 3867, 1.0
[READ], 4395, 1.0
[READ], 346879, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 19272.0
[CLEANUP], MinLatency(us), 19264
[CLEANUP], MaxLatency(us), 19279
[CLEANUP], 95thPercentileLatency(us), 19279
[CLEANUP], 99thPercentileLatency(us), 19279
[CLEANUP], 19279, 1.0
[UPDATE], Operations, 4986
[UPDATE], AverageLatency(us), 33.941235459286
[UPDATE], MinLatency(us), 24
[UPDATE], MaxLatency(us), 3523
[UPDATE], 95thPercentileLatency(us), 50
[UPDATE], 99thPercentileLatency(us), 76
[UPDATE], Return=OK, 4986
[UPDATE], 24, 2.0
[UPDATE], 25, 4.0
[UPDATE], 26, 12.0
[UPDATE], 27, 154.0
[UPDATE], 28, 523.0
[UPDATE], 29, 1148.0
[UPDATE], 30, 888.0
[UPDATE], 31, 659.0
[UPDATE], 32, 531.0
[UPDATE], 33, 307.0
[UPDATE], 34, 161.0
[UPDATE], 35, 72.0
[UPDATE], 36, 36.0
[UPDATE], 37, 19.0
[UPDATE], 38, 35.0
[UPDATE], 39, 28.0
[UPDATE], 40, 20.0
[UPDATE], 41, 20.0
[UPDATE], 42, 19.0
[UPDATE], 43, 6.0
[UPDATE], 44, 3.0
[UPDATE], 45, 7.0
[UPDATE], 46, 4.0
[UPDATE], 47, 8.0
[UPDATE], 48, 21.0
[UPDATE], 49, 39.0
[UPDATE], 50, 33.0
[UPDATE], 51, 23.0
[UPDATE], 52, 11.0
[UPDATE], 53, 7.0
[UPDATE], 54, 6.0
[UPDATE], 55, 2.0
[UPDATE], 56, 11.0
[UPDATE], 57, 2.0
[UPDATE], 58, 2.0
[UPDATE], 59, 6.0
[UPDATE], 60, 4.0
[UPDATE], 61, 3.0
[UPDATE], 62, 2.0
[UPDATE], 63, 5.0
[UPDATE], 64, 4.0
[UPDATE], 66, 6.0
[UPDATE], 67, 5.0
[UPDATE], 68, 5.0
[UPDATE], 69, 8.0
[UPDATE], 70, 6.0
[UPDATE], 71, 15.0
[UPDATE], 72, 16.0
[UPDATE], 73, 11.0
[UPDATE], 74, 10.0
[UPDATE], 75, 6.0
[UPDATE], 76, 3.0
[UPDATE], 77, 1.0
[UPDATE], 78, 2.0
[UPDATE], 80, 1.0
[UPDATE], 81, 2.0
[UPDATE], 82, 2.0
[UPDATE], 83, 2.0
[UPDATE], 84, 3.0
[UPDATE], 85, 4.0
[UPDATE], 89, 1.0
[UPDATE], 90, 1.0
[UPDATE], 92, 1.0
[UPDATE], 93, 1.0
[UPDATE], 95, 1.0
[UPDATE], 98, 2.0
[UPDATE], 99, 1.0
[UPDATE], 102, 2.0
[UPDATE], 106, 1.0
[UPDATE], 111, 1.0
[UPDATE], 112, 1.0
[UPDATE], 115, 2.0
[UPDATE], 116, 1.0
[UPDATE], 117, 1.0
[UPDATE], 118, 1.0
[UPDATE], 122, 1.0
[UPDATE], 125, 1.0
[UPDATE], 135, 1.0
[UPDATE], 172, 1.0
[UPDATE], 184, 1.0
[UPDATE], 185, 1.0
[UPDATE], 188, 1.0
[UPDATE], 238, 1.0
[UPDATE], 240, 1.0
[UPDATE], 519, 1.0
[UPDATE], 706, 1.0
[UPDATE], 867, 1.0
[UPDATE], 3523, 1.0